{
  "sp-cbs": {
    "name": "Specialist Program in Conservation and Biodiversity",
    "url":"https://utsc.calendar.utoronto.ca/specialist-program-conservation-and-biodiversity-science",
    "intro": "This program presents a foundation for understanding how ecology and evolution shape organismal features (from morphology and physiology to behaviour) and the structure and function of communities and ecosystems. Ultimately these processes determine the broad patterns of organization of life on earth and biodiversity. The challenges to biodiversity are daunting. Habitat destruction, biological invasions and climate change are causing loss of species and disruption of ecosystems worldwide. Graduates are trained to understand and actively seek solutions to these problems. This program will show how ecological and evolutionary perspectives can be used to understand and predict the outcome of dynamic interactions among organisms, populations, species, and communities. Students will be well trained to take positions in government agencies, consulting firms or NGO's, able to continue with graduate studies in science for academic careers, or able to pursue careers in business or law related to environmental issues, stewardship and sustainable development.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n1.0 credit from MATA29, A35 or MATA30, A36\n1.0 credit from PHYA10, A11\n0.5 credits from CSCA08, A20, PSCB57"
      },
      {
        "label": "Year 2",
        "msg": "3.0 credits from BIOB10, B11, B34, B38/B31, B50, B51\n0.5 credits from BIOB52\n0.5 credits from STAB22 or PSYB07"
      },
      {
        "label": "Year 3",
        "msg": "2.0 credits from BIOC16, C50, C59, C61"
      },
      {
        "label": "Year 3/4",
        "msg": "4.5 credits from\n Ecology/Evolution\n Organismal Biology\nAt least one credit from each\nAt least one credit at D level"
      }
    ]
  },
  "sp-hbs": {
    "name": "Specialist Program in Human Biology",
    "url":"https://utsc.calendar.utoronto.ca/specialist-program-human-biology-science",
    "intro": "The Specialist in Human Biology provides a solid foundation of introductory science courses and core biology courses while emphasizing, in the upper years, issues related to human health, the nature of humans and their culture as well as the interaction of the human species with the environment. The first year of the program emphasizes introductory courses in biology, chemistry, calculus, physics and psychology. The second year of the program emphasizes core courses in cell biology, molecular biology, physiology, ecology, evolution and anatomy that provide the basis for continued specialization in the third and fourth years. The upper years of the program emphasize specialized courses in anatomy, biochemistry, endocrinology, immunology, microbiology, physiology, psychology, pathology and pathobiology. This program is suited for those students who wish to go onto health-related fields such as medicine, dentistry, nursing, pharmacy, physiotherapy and health policy/management or graduate studies in these, and other, areas such as physiology, medicine and endocrinology.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n1.0 credit from MATA29, A35 or MATA30, A36\n1.0 credit from PHYA10, A11\n0.5 credits from STAB22 or PSYB07"
      },
      {
        "label": "Year 2",
        "msg": "3.0 credits from BIOB10, B11, B34, B38/B31, B50, B51\n1.0 credit from BIOB32, B33\n1.0 credit from CHMB41, B42"
      },
      {
        "label": "Year 3/4",
        "msg": "2.5 credits from BIOC15, C17, C20, C32, C34, C39\n1.5 credits from BIOC10, C12, C13, C14, C16, C19, C21, C35, C40, C58, C65\n1.0 credit from D level Biology Courses\n 0.5 credits from Psychology or Health Studies"
      }
    ]
  },
  "sp-ibs": {
    "name": "Specialist Program in Integrative Biology",
    "url":"https://utsc.calendar.utoronto.ca/specialist-program-integrative-biology-science",
    "intro": "In today's rapidly changing world, the development of solutions to combat some of the most pressing global challenges such as climate change, emerging diseases, hunger and species extinction, requires an integrative approach in which expertise is drawn from disparate biological and other disciplines. The specialist program in Integrative Biology provides the student with a solid knowledge base in key core and foundational areas of biology while also providing a breadth of knowledge to support more specialized studies and focused training in a range of disciplines (for examples, see below under \"Routes to Specialization\"). Students who complete this program will be well positioned for a career in many aspects of the biological sciences or to undertake further studies at the professional or graduate level.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n1.0 credit from MATA29, A35 or MATA30, A36\n1.0 credit from PHYA10, A11\n0.5 credits from CSCA08, A20, PSCB57"
      },
      {
        "label": "Year 2",
        "msg": "3.0 credits from BIOB10, B11, B34, B38/B31, B50, B51\n0.5 credits from BIOB12, B32, B33, B52\n0.5 credits from STAB22 or PSYB07"
      },
      {
        "label": "Year 3",
        "msg": "1.5 credits from BIOC15, C17, C54"
      },
      {
        "label": "Year 3/4",
        "msg": "0.5 credits from Advanced Physio/Biochem/Neurobio\n0.5 credits from Advanced Ecology and Conservation\n0.5 credits from Advanced Genes and Development\n0.5 credits from Advanced Organismal Biology\n3.0 credits of Additional C/D level courses"
      }
    ]
  },
  "sp-mbbs": {
    "name": "Specialist Program in Molecular Biology and Biotechnology",
    "url":"https://utsc.calendar.utoronto.ca/specialist-program-molecular-biology-and-biotechnology-science",
    "intro": "The Molecular Biology and Biotechnology program strives to help students construct a broad foundation of knowledge across the major disciplines of biology in the first two years of study, and combines this knowledge with an increasingly analytical and reflective approach to learning. Upon this base, students deepen their knowledge of biological processes that occur at the cellular and molecular level through the course work of their third and fourth years. This is a laboratory-rich program that integrates an understanding of chemical and physical processes with our complex biological systems. Because of broad training in biology and rigorous cross training in cognate disciplines, graduates are well positioned to apply to professional and graduate schools or work in a broad range of government regulatory agencies, clinical or research-focused industries and other careers that require the union of strong analytical and technical skills.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n1.0 credit from MATA29, A35 or MATA30, A36\n1.0 credit from PHYA10, A11 or PHYA21, A22\n0.5 credits from STAB22 or PSYB07"
      },
      {
        "label": "Year 2",
        "msg": "3.0 credits from BIOB10, B11, B34, B38/B31, B50, B51\n0.5 credits from BIOB12\n1.0 credit from CHMB41, B42"
      },
      {
        "label": "Year 3",
        "msg": "3.5 credits from BIOC12, C13, C15, C17, C20, C23, C39\n0.5 credits from CSCA08, A20, PSCB57"
      },
      {
        "label": "Year 3/4",
        "msg": "0.5 credits from BIOC10, C14, C19, C21, C31, C35, C40, D37"
      },
      {
        "label": "Year 4",
        "msg": "0.5 credits from BIOD21\n 0.5 credits from BIOD12, D17, D19, D20, D22, D23, D25, D26, D27, D29, D30, D95, D98"
      }
    ]
  },
  "sp-combbs": {
    "name": "Specialist (Co-operative) Program in Molecular Biology and Biotechnology",
    "url":"https://utsc.calendar.utoronto.ca/specialist-co-operative-program-molecular-biology-and-biotechnology-science",
    "intro": "The Molecular Biology and Biotechnology program strives to help students construct a broad foundation of knowledge across the major disciplines of biology in the first two years of study, and combine this knowledge with an increasingly analytical and reflective approach to learning. Upon this base, students deepen their knowledge of biological processes that occur at the cellular and molecular level through course work of their third and fourth years. This is a laboratory-rich program that integrates an understanding of chemical and physical processes with our complex biological systems. Because of broad training in biology and rigorous cross-training in cognate disciplines, graduates are well positioned to apply to professional and graduate schools or work in a broad range of government regulatory agencies, clinical or research-focused industries and other careers that require the union of strong analytical and technical skills. The co-op option of the Molecular Biology and Biotechnology program complements and punctuates academic course work with full-time work terms in research laboratories, government, health care, or in public or private industry.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n1.0 credit from MATA29, A35 or MATA30, A36\n1.0 credit from PHYA10, A11 or PHYA21, A22\n0.5 credits from STAB22 or PSYB07"
      },
      {
        "label": "Year 2",
        "msg": "3.0 credits from BIOB10, B11, B34, B38/B31, B50, B51\n0.5 credits from BIOB12\n1.0 credit from CHMB41, B42"
      },
      {
        "label": "Year 3",
        "msg": "3.5 credits from BIOC12, C13, C15, C17, C20, C23, C39\n0.5 credits from CSCA08, A20, PSCB57"
      },
      {
        "label": "Year 3/4",
        "msg": "0.5 credits from BIOC10, C14, C19, C21, C31, C35, C40, D37"
      },
      {
        "label": "Year 4",
        "msg": "0.5 credits from BIOD21\n 0.5 credits from BIOD12, D17, D19, D20, D22, D23, D25, D26, D27, D29, D30, D95, D98"
      },
      {
        "label": "Work Term Requirements",
        "msg": "Students must satisfactorily complete two Co-op work terms, each of four-months duration. To be eligible for their first work term, students must be enrolled in the Specialist (Co-op) Program in Molecular Biology and Biotechnology and have completed at least 10.0 credits\n2.0 credits from COPD01, D03, D11, D12 are required"
      }
    ]
  },
  "mj-bs": {
    "name": "Major Program in Biology",
    "url":"https://utsc.calendar.utoronto.ca/major-program-biology-science",
    "intro": "Biology is the study of life and this major program in Biology is meant to provide students with a solid basic knowledge of this vast discipline, while also allowing the student to tailor their program in the upper years toward one or more biological sub-disciplines. Many of the world's most important and timely issues (medical science and disease, conservation and biodiversity, food and energy supplies) are issues that require citizens to have a firm understanding of biological principles and practices.\nThe Major program in Biology (Science) cannot be combined with any other Major program offered by the Department of Biological Sciences.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n0.5 credits from MATA29, A30, STAB22 or PSYB07"
      },
      {
        "label": "Year 2",
        "msg": "3.0 credits from BIOB10, B11, B34/B30, B38/B31, B50, B51\n0.5 credits from BIOB12, B32, B33, B52"
      },
      {
        "label": "Year 3",
        "msg": "1.5 credits of C level Bio courses\nNote: NROC34H3 may also be used"
      },
      {
        "label": "Year 4",
        "msg": "0.5 credits of Additional D Level Bio courses"
      }
    ]
  },
  "mj-cbs": {
    "name": "Major Program in Conservation and Biodiversity",
    "url":"https://utsc.calendar.utoronto.ca/major-program-conservation-and-biodiversity-science",
    "intro": "This program provides background and training in modern biological approaches to the study of biodiversity, ecology, and evolution. The links between these fields are emphasized, and topics covered range from the structure and function of ecosystems to the evolution of behaviour, morphology, and physiology.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n0.5 credits from MATA29, A30, STAB22 or PSYB07"
      },
      {
        "label": "Year 2",
        "msg": "3.0 credits from BIOB10, B11, B34, B38/B31, B50, B51\n0.5 credits from BIOB52"
      },
      {
        "label": "Year 3",
        "msg": "1.0 credit from BIOC16, C50, C59, C61\n1.0 credit from BIOC37, C40, C51, C52, C54, C58, C60, C62, C63, C65, EESC04, C30"
      },
      {
        "label": "Year 4",
        "msg": "0.5 credits from BIOD25, D26, D33, D43, D45, D48, D52, D53, D54, D55, D59, D60, D62, D63, D66, D67, EESD15H3"
      }
    ]
  },
  "mj-hbs": {
    "name": "Major Program in Human Biology",
    "url":"https://utsc.calendar.utoronto.ca/major-program-human-biology-science",
    "intro": "The Major in Human Biology provides training and background in general biology with the opportunity to concentrate on courses in upper years that are related to human health. Upper year courses are available in physiology, cell and molecular biology, anatomy, microbiology, pathology, endocrinology, anthropology, psychology and biochemistry. This program is suitable for students with an interest in applied biology in health sciences or in social sciences related to human health.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n1.0 credit from PSYA01, A02\n0.5 credits from MATA29, A30, STAB22 or PSYB07"
      },
      {
        "label": "Year 2",
        "msg": "2.5 credits from BIOB10, B11, B34, B50, B51\n0.5 credits from BIOB32, B33"
      },
      {
        "label": "Year 3/4",
        "msg": "1.5 credits from BIOC10, C14, C15, C16, C17, C19, C20, C21, C32, C34, C35, C39, C54, C58, C65, NROC61, C64, C69H3\n0.5 credits from BIOD07,D08, D12, D17, D19, D20, D26, D29, D33, D35, D43, D59, D65, D95, NROD66, D67"
      }
    ]
  },
  "mj-mbids": {
    "name": "Major Program in Molecular Biology, Immunology and Disease",
    "url":"https://utsc.calendar.utoronto.ca/major-program-molecular-biology-immunology-and-disease-science",
    "intro": "This program provides training and background in general biology with the opportunity to concentrate on courses in upper years that are related to immunology, infection and disease. Upper year courses are available in microbiology, immunology, biochemistry and pathobiology of disease. This program is suitable for students with an interest in molecular biology and disease.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n0.5 credits from MATA29, A30, STAB22 or PSYB07"
      },
      {
        "label": "Year 2",
        "msg": "2.5 credits from BIOB10, B11, B34, B50, B51\n0.5 credits from BIOB12, B32, B33"
      },
      {
        "label": "Year 3/4",
        "msg": "1.5 credits from BIOC17, C20, C39\n1.0 credit from BIOC10, C12, C13, C14, C15, C19, C31, C35\n0.5 credits from BIOD12, D17, D19, D20, D23, D25, D26, D27, D29"
      }
    ]
  },
  "mj-pbs": {
    "name": "Major Program in Plant Biology",
    "url":"https://utsc.calendar.utoronto.ca/major-program-plant-biology-science",
    "intro": "The Major in Plant Biology provides a broad education in all areas of contemporary biology, and affords students an opportunity to concentrate on courses in upper years that are focused on plant biology. This program is suitable for students with an interest in the biochemistry, biotechnology, cell biology, ecology, evolution, genetics, physiology, and/or development of plants.",
    "yearInfo": [
      {
        "label": "Year 1",
        "msg": "1.0 credit from BIOA01, A02\n1.0 credit from CHMA10, A11\n0.5 credits from STAB22 or PSYB07"
      },
      {
        "label": "Year 2",
        "msg": "2.5 credits from BIOB10, B11, B38, B50, B51\n0.5 credits from BIOB12, B52"
      },
      {
        "label": "Year 3",
        "msg": "2.0 credits from BIOC31, C37, C40, C15, C17, C50"
      },
      {
        "label": "Year 3/4",
        "msg": "0.5 credits from BIOC61, D21, D37, D62, D26"
      },
      {
        "label": "Year 4",
        "msg": "0.5 credits from BIOD30, C99, D9, D98, D99"
      }
    ]
  },
  "mi-bs": {
    "name": "Minor Program in Biology",
    "url":"https://utsc.calendar.utoronto.ca/minor-program-biology-science",
    "intro": "Enrolment in the Minor in Biology is unlimited. The Minor in Biology cannot be combined with any Major or Specialist programs offered by the Department of Biological Sciences.",
    "yearInfo": []
  }
}